newwms_gift/src/Enums/итWMSСтатусыСкладскихДокументов/итWMSСтатусыСкладскихДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>итWMSСтатусыСкладскихДокументов</name>
  <enumValues>
    <name>Создан</name>
  </enumValues>
  <enumValues>
    <name>Зарезервирован</name>
  </enumValues>
  <enumValues>
    <name>Распределяется</name>
  </enumValues>
  <enumValues>
    <name>Распределен</name>
  </enumValues>
  <enumValues>
    <name>Выполнен</name>
  </enumValues>
  <enumValues>
    <name>ВыполненСОшибкой</name>
  </enumValues>
  <enumValues>
    <name>Завершен</name>
  </enumValues>
</mdclass:Enum>

newwms_gift/src/CommonForms/итWMSСервеснаяФорма/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если Параметры.ИмяКоманды="итWMSЗаполнитьЯчейкиРежим1" Тогда 
		ОбработчикитWMSЗаполнитьЯчейкиРежим1();
	КонецЕсли;
	ЭтаФорма.Закрыть();
	КонецПроцедуры
&НаКлиенте	
Процедура ОбработчикитWMSЗаполнитьЯчейкиРежим1()
	Если ПроверкаНаСтатусДокумента(ВладелецФормы.Объект.СтатусДокумента) Тогда 
		Возврат
	КонецЕсли;	
	ЯчейкаПолучатель=Неопределено;
	ЯчейкаПолучатель=ВладелецФормы.Объект.Товары[0].ЯчейкаПолучатель;
	ФиксацияСтроки=Ложь;
	Попытка
		ФиксацияСтроки=ВладелецФормы.Объект.Товары[0].ФиксацияСтроки;
		ФиксацияСтроки=Истина;
	Исключение
		ФиксацияСтроки=Ложь;
	КонецПопытки;
	Для Каждого стр из ВладелецФормы.Объект.Товары цикл
		Если ФиксацияСтроки Тогда 
			Если стр.ФиксацияСтроки Тогда 
				Продолжить;
			КонецЕсли;
		КонецЕсли;	
			стр.ЯчейкаПолучатель=ЯчейкаПолучатель;
		КонецЦикла;
	КонецПроцедуры
&НаСервере	
Функция  ПроверкаНаСтатусДокумента(СтатусДокумента)
		Если СтатусДокумента=Перечисления.итWMSСтатусыСкладскихДокументов.Зарезервирован Тогда 
			Возврат Ложь;
		КонецЕсли;	
		Если  СтатусДокумента=Перечисления.итWMSСтатусыСкладскихДокументов.Распределяется Тогда 
			Возврат Ложь;
		КонецЕсли;	
		Если  СтатусДокумента=Перечисления.итWMSСтатусыСкладскихДокументов.Создан Тогда 
			Возврат Ложь;
		КонецЕсли;	
		Возврат Истина;
КонецФункции
